stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_system.h
/**
  ******************************************************************************
  * @file    stm32wl3x_ll_system.h
  * @author  MCD Application Team
  * @brief   Header file of SYSTEM LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    [..]
    The LL SYSTEM driver contains a set of generic APIs that can be
    used by user:
      (+) Some of the FLASH features need to be handled in the SYSTEM file.
      (+) Access to SYSCFG registers

  @endverbatim
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WL3x_LL_SYSTEM_H
#define STM32WL3x_LL_SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wl3x.h"

/** @addtogroup STM32WL3x_LL_Driver
  * @{
  */

#if defined (FLASH) || defined (SYSCFG)

/** @defgroup SYSTEM_LL SYSTEM
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Private_Constants SYSTEM Private Constants
  * @{
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup SYSCFG_IO_LL_ES_INIT SYSTEM Exported Init structure
  * @{
  */
typedef struct
{

  uint32_t Line;                 /*!< Specifies the EXTI lines to be enabled or disabled for Lines in range PA0 to PB15
                                      This parameter can be any combination of @ref EXTI_LL_EC_LINE */

  FunctionalState LineCommand;  /*!< Specifies the new state of the selected EXTI lines.
                                     This parameter can be set either to ENABLE or DISABLE */

  uint8_t Type;                 /*!< Specifies the type for the EXTI lines EDGE or LEVEL.
                                     This parameter can be a value of @ref SYSTEM_LL_EC_TYPE. */

  uint8_t Trigger;              /*!< Specifies the trigger signal active edge/level for the EXTI lines.
                                     This parameter can be a value of @ref SYSTEM_LL_EC_TRIGGER. */
} LL_SYSCFG_IO_InitTypeDef;

/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Constants SYSTEM Exported Constants
  * @{
  */

/** @defgroup SYSTEM_LL_EC_REMAP SYSCFG REMAP
  * @{
  */
#define LL_SYSCFG_REMAP_FLASH                   0x00000000U                 /*!< Main Flash memory mapped at 0x00000000   */
#define LL_SYSCFG_REMAP_SRAM                    FLASH_CONFIG_REMAP                  /*!< SRAM mapped at 0x00000000               */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_I2C_FASTMODEPLUS SYSCFG I2C FASTMODEPLUS
  * @{
  */
#if defined(SYSCFG_I2C_FMP_CTRL_I2C1_PA0_FMP)
#define LL_SYSCFG_I2C_FASTMODEPLUS_PA0          SYSCFG_I2C_FMP_CTRL_I2C1_PA0_FMP /*!< Enable Fast Mode Plus on PA0       */
#endif
#if defined(SYSCFG_I2C_FMP_CTRL_I2C1_PA1_FMP)
#define LL_SYSCFG_I2C_FASTMODEPLUS_PA1          SYSCFG_I2C_FMP_CTRL_I2C1_PA1_FMP /*!< Enable Fast Mode Plus on PA1       */
#endif
#if defined(SYSCFG_I2C_FMP_CTRL_I2C1_PB6_FMP)
#define LL_SYSCFG_I2C_FASTMODEPLUS_PB6          SYSCFG_I2C_FMP_CTRL_I2C1_PB6_FMP  /*!< Enable Fast Mode Plus on PB6       */
#endif
#if defined(SYSCFG_I2C_FMP_CTRL_I2C1_PB7_FMP)
#define LL_SYSCFG_I2C_FASTMODEPLUS_PB7          SYSCFG_I2C_FMP_CTRL_I2C1_PB7_FMP  /*!< Enable Fast Mode Plus on PB7       */
#endif
#if defined(SYSCFG_I2C_FMP_CTRL_I2C1_PB10_FMP)
#define LL_SYSCFG_I2C_FASTMODEPLUS_PB10         SYSCFG_I2C_FMP_CTRL_I2C1_PB10_FMP /*!< Enable Fast Mode Plus on PB10      */
#endif
#if defined(SYSCFG_I2C_FMP_CTRL_I2C1_PB11_FMP)
#define LL_SYSCFG_I2C_FASTMODEPLUS_PB11         SYSCFG_I2C_FMP_CTRL_I2C1_PB11_FMP /*!< Enable Fast Mode Plus on PB11      */
#endif
#if defined(SYSCFG_I2C_FMP_CTRL_I2C2_PA6_FMP)
#define LL_SYSCFG_I2C_FASTMODEPLUS_PA6          SYSCFG_I2C_FMP_CTRL_I2C2_PA6_FMP  /*!< Enable Fast Mode Plus on PA6       */
#endif
#if defined(SYSCFG_I2C_FMP_CTRL_I2C2_PA7_FMP)
#define LL_SYSCFG_I2C_FASTMODEPLUS_PA7          SYSCFG_I2C_FMP_CTRL_I2C2_PA7_FMP  /*!< Enable Fast Mode Plus on PA7       */
#endif
#if defined(SYSCFG_I2C_FMP_CTRL_I2C2_PA13_FMP)
#define LL_SYSCFG_I2C_FASTMODEPLUS_PA13         SYSCFG_I2C_FMP_CTRL_I2C2_PA13_FMP /*!< Enable Fast Mode Plus on PA13      */
#endif
#if defined(SYSCFG_I2C_FMP_CTRL_I2C2_PA14_FMP)
#define LL_SYSCFG_I2C_FASTMODEPLUS_PA14         SYSCFG_I2C_FMP_CTRL_I2C2_PA14_FMP /*!< Enable Fast Mode Plus on PA14      */
#endif
/**
  * @}
  */
/** @defgroup SYSTEM_LL_PWRC_IM SYSCFG Power Controller Interrupt MASK
  * @{
  */
#define LL_SYSCFG_PWRC_PVD                     SYSCFG_PWRC_IER_PVD_IE  /*!< PVD interrupt mask  */
#define LL_SYSCFG_PWRC_WKUP                    SYSCFG_PWRC_IER_WKUP_IE /*!< WKUP interrupt mask */
#define LL_SYSCFG_PWRC_BORH                    SYSCFG_PWRC_IER_BORH_IE /*!< BORH interrupt mask */
/**
  * @}
  */

/** @defgroup SYSCFG_IO_LL_Exported_Constants EXTI Exported Constants
  * @{
  */

/** @defgroup EXTI_LL_EC_LINE LINE
  * @{
  */
#define LL_EXTI_LINE_PA0        (uint32_t)(1U << 0U)    /*!< PA0  */
#define LL_EXTI_LINE_PA1        (uint32_t)(1U << 1U)    /*!< PA1  */
#define LL_EXTI_LINE_PA2        (uint32_t)(1U << 2U)    /*!< PA2  */
#define LL_EXTI_LINE_PA3        (uint32_t)(1U << 3U)    /*!< PA3  */
#define LL_EXTI_LINE_PA4        (uint32_t)(1U << 4U)    /*!< PA4  */
#define LL_EXTI_LINE_PA5        (uint32_t)(1U << 5U)    /*!< PA5  */
#define LL_EXTI_LINE_PA6        (uint32_t)(1U << 6U)    /*!< PA6  */
#define LL_EXTI_LINE_PA7        (uint32_t)(1U << 7U)    /*!< PA7  */
#define LL_EXTI_LINE_PA8        (uint32_t)(1U << 8U)    /*!< PA8  */
#define LL_EXTI_LINE_PA9        (uint32_t)(1U << 9U)    /*!< PA9  */
#define LL_EXTI_LINE_PA10       (uint32_t)(1U << 10U)   /*!< PA10 */
#define LL_EXTI_LINE_PA11       (uint32_t)(1U << 11U)   /*!< PA11 */
#define LL_EXTI_LINE_PA12       (uint32_t)(1U << 12U)   /*!< PA12 */
#define LL_EXTI_LINE_PA13       (uint32_t)(1U << 13U)   /*!< PA13 */
#define LL_EXTI_LINE_PA14       (uint32_t)(1U << 14U)   /*!< PA14 */
#define LL_EXTI_LINE_PA15       (uint32_t)(1U << 15U)   /*!< PA15 */
#define LL_EXTI_LINE_PB0        (uint32_t)(1U << 16U)   /*!< PB0  */
#define LL_EXTI_LINE_PB1        (uint32_t)(1U << 17U)   /*!< PB1  */
#define LL_EXTI_LINE_PB2        (uint32_t)(1U << 18U)   /*!< PB2  */
#define LL_EXTI_LINE_PB3        (uint32_t)(1U << 19U)   /*!< PB3  */
#define LL_EXTI_LINE_PB4        (uint32_t)(1U << 20U)   /*!< PB4  */
#define LL_EXTI_LINE_PB5        (uint32_t)(1U << 21U)   /*!< PB5  */
#define LL_EXTI_LINE_PB6        (uint32_t)(1U << 22U)   /*!< PB6  */
#define LL_EXTI_LINE_PB7        (uint32_t)(1U << 23U)   /*!< PB7  */
#define LL_EXTI_LINE_PB8        (uint32_t)(1U << 24U)   /*!< PB8  */
#define LL_EXTI_LINE_PB9        (uint32_t)(1U << 25U)   /*!< PB9  */
#define LL_EXTI_LINE_PB10       (uint32_t)(1U << 26U)   /*!< PB10 */
#define LL_EXTI_LINE_PB11       (uint32_t)(1U << 27U)   /*!< PB11 */
#define LL_EXTI_LINE_PB12       (uint32_t)(1U << 28U)   /*!< PB12 */
#define LL_EXTI_LINE_PB13       (uint32_t)(1U << 29U)   /*!< PB13 */
#define LL_EXTI_LINE_PB14       (uint32_t)(1U << 30U)   /*!< PB14 */
#define LL_EXTI_LINE_PB15       (uint32_t)(1U << 31U)   /*!< PB15 */
#define LL_EXTI_LINE_ALL        (uint32_t)(0xFFFFFFFFU) /*!< All the EXTI lines PA0...PB15 */

#if defined(USE_FULL_LL_DRIVER)
#define LL_EXTI_LINE_NONE              (0x00000000U)    /*!< None Extended line */
#endif /*USE_FULL_LL_DRIVER*/
/**
  * @}
  */

