stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_system.h
/** @defgroup SYSTEM_LL_EC_TYPE Type
  * @{
  */
#define LL_EXTI_TYPE_EDGE               ((uint8_t)0x00U) /*!<  Interrupt Type EDGE detection */
#define LL_EXTI_TYPE_LEVEL              ((uint8_t)0x01U) /*!<  Interrupt Type LEVEL detection */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TRIGGER Edge Trigger
  * @{
  */
#define LL_EXTI_TRIGGER_NONE                 ((uint8_t)0x00U) /*!< Trigger None */
#define LL_EXTI_TRIGGER_RISING_EDGE          ((uint8_t)0x01U) /*!< Trigger Rising Edge */
#define LL_EXTI_TRIGGER_FALLING_EDGE         ((uint8_t)0x02U) /*!< Trigger Falling Edge */
#define LL_EXTI_TRIGGER_BOTH_EDGE            ((uint8_t)0x03U) /*!< Trigger Both Edge */
#define LL_EXTI_TRIGGER_LOW_LEVEL            ((uint8_t)0x04U) /*!< Trigger Low Level */
#define LL_EXTI_TRIGGER_HIGH_LEVEL           ((uint8_t)0x05U) /*!< Trigger High Level */
/**
  * @}
  */


/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_LATENCY FLASH LATENCY
  * @{
  */
#define LL_FLASH_WAIT_STATES_0                 0x00000000U                  /*!< FLASH Zero wait state  */
#define LL_FLASH_WAIT_STATES_1                 FLASH_CONFIG_WAIT_STATES_0   /*!< FLASH One wait state when system clock frequency is 64 MHz */
#define LL_FLASH_LATENCY_0                     0x00000000U                  /*!< FLASH Zero wait state  */
#define LL_FLASH_LATENCY_1                     FLASH_CONFIG_WAIT_STATES_0   /*!< FLASH One wait state when system clock frequency is 64 MHz */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_DEVICE_INFORMATION Device Version Information
  * @{
  */
#if defined (MR_SUBG)
#define LL_SPIRIT3_CUT_10                  0x10
#endif
/**
  * @}
  */


/** @defgroup SYSTEM_LL_IO_ANALOG_SWITCH IO GPIOB14 analog configuration
  * @{
  */
#define LL_SYSCFG_PB14_PVD      0x00000000U                      /*!< PVD external voltage feature is selected */
#define LL_SYSCFG_PB14_ATB1     SYSCFG_GPIO_SWA_CTRL_ATB1_nPVD   /*!< ATB1 feature is selected                 */

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB0_STOP_IP DBGMCU APB0 _GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB0_GRP1_TIM2_STOP      DBGMCU_DBG_APB0_FZ_DBG_TIM2_STOP   /*!< The counter clock of TIM2 is stopped when the core is halted              */
#define LL_DBGMCU_APB0_GRP1_TIM16_STOP     DBGMCU_DBG_APB0_FZ_DBG_TIM16_STOP   /*!< The counter clock of TIM16 is stopped when the core is halted              */
#define LL_DBGMCU_APB0_GRP1_RTC_STOP       DBGMCU_DBG_APB0_FZ_DBG_RTC_STOP    /*!< The clock of the RTC counter is stopped when the core is halted           */
#define LL_DBGMCU_APB0_GRP1_IWDG_STOP      DBGMCU_DBG_APB0_FZ_DBG_IWDG_STOP   /*!< The independent watchdog counter clock is stopped when the core is halted */

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_APB1_STOP_IP DBGMCU APB1 _GRP1 STOP IP
  * @{
  */
#define LL_DBGMCU_APB1_GRP1_I2C1_STOP      DBGMCU_DBG_APB1_FZ_DBG_I2C1_STOP   /*!< The counter clock of I2C1 is stopped when the core is halted              */
#define LL_DBGMCU_APB1_GRP1_I2C2_STOP      DBGMCU_DBG_APB1_FZ_DBG_I2C2_STOP  /*!< The counter clock of I2C2 is stopped when the core is halted             */

/**
  * @}
  */

/** @defgroup SYSCFG_LL_RXTX_DET_TYPE Tx/Rx sequence information detection type
  * @{
  */
#define LL_SYSCFG_MR_SUBG_DET_TYPE_EDGE           ((uint8_t)0x00U) /*!<  Tx/Rx, COMP_OUT and RF_IP_BUSY_STATUS detection type EDGE  */
#define LL_SYSCFG_MR_SUBG_DET_TYPE_LEVEL          ((uint8_t)0x01U) /*!<  Tx/Rx, COMP_OUT and RF_IP_BUSY_STATUS detection type LEVEL */
/**
  * @}
  */

/** @defgroup SYSCFG_LL_RXTX_EDGE_TRIGGER Tx/Rx detection trigger
  * @{
  */
#define LL_SYSCFG_MR_SUBG_TRIGGER_RISING_EDGE     ((uint8_t)0x00U) /*!< Trigger on Rising Edge  */
#define LL_SYSCFG_MR_SUBG_TRIGGER_FALLING_EDGE    ((uint8_t)0x01U) /*!< Trigger on Falling Edge */
#define LL_SYSCFG_MR_SUBG_TRIGGER_BOTH_EDGE       ((uint8_t)0x02U) /*!< Trigger on Both Edge    */
#define LL_SYSCFG_MR_SUBG_TRIGGER_LOW_LEVEL       ((uint8_t)0x03U) /*!< Trigger on Low Level    */
#define LL_SYSCFG_MR_SUBG_TRIGGER_HIGH_LEVEL      ((uint8_t)0x04U) /*!< Trigger on High Level   */
/**
  * @}
  */

/** @defgroup SYSCFG_LL_TX_RX_EVENT_ENABLE Tx/Rx event
  * @{
  */
#define LL_SYSCFG_MR_SUBG_TX_EVENT               SYSCFG_INTAI_IER_TX_IE                /*!< Tx Event Enable               */
#define LL_SYSCFG_MR_SUBG_RX_EVENT               SYSCFG_INTAI_IER_RX_IE                /*!< Rx Event Enable               */
#define LL_SYSCFG_MR_SUBG_COMPOUT_EVENT          SYSCFG_INTAI_IER_COMP_IE              /*!< COMP_OUT Event Enable         */
#define LL_SYSCFG_MR_SUBG_RFIP_BUSY_EVENT        SYSCFG_INTAI_IER_RFIP_BUSY_STATUS_IE  /*!< RFIP_BUSY_STATUS Event Enable */
#define LL_SYSCFG_LCSC_LC_ACTIVITY_ISC           SYSCFG_INTAI_ISCR_LC_ACTIVITY_ISC     /*!< Edge status on LC_ACTIVITY signal Event Enable */
#define LL_SYSCFG_LCSC_LC_ACTIVITY_ISEDGE        SYSCFG_INTAI_ISCR_LC_ACTIVITY_ISEDGE  /*!< Status on LC_ACTIVITY Event Enable */
#define LL_SYSCFG_LCSC_LC_ACTIVITY_FALLING_EDGE  (0U)                                  /*!< Falling Edge LC_ACTIVITY Event */
#define LL_SYSCFG_LCSC_LC_ACTIVITY_RISING_EDGE   (1U)                                  /*!< Rising Edge LC_ACTIVITY Event */
#define LL_SYSCFG_LCSC_IBER_SINGLE               (0U)                                  /*!< Detection on single edge */
#define LL_SYSCFG_LCSC_IBER_BOTH                 (SYSCFG_INTAI_IBER_LC_ACTIVITY_IBE)   /*!< Detection on both edges */
#define LL_SYSCFG_LCSC_IEVR_FALLING              (0U)                                  /*!< Detection on falling edge / low level */
#define LL_SYSCFG_LCSC_IEVR_RISING               (SYSCFG_INTAI_IEVR_LC_ACTIVITY_IEV)   /*!< Detection on rising edge / high level */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup SYSCFG_IO_LL_Exported_Macros SYSTEM Exported Macros
  * @{
  */

/** @defgroup EXTI_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in SYSCFG register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_SYSCFG_WriteReg(__REG__, __VALUE__) WRITE_REG(SYSCFG->__REG__, (__VALUE__))

/**
  * @brief  Read a value in SYSCFG register
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_SYSCFG_ReadReg(__REG__) READ_REG(SYSCFG->__REG__)
/**
  * @}
  */


/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Functions SYSTEM Exported Functions
  * @{
  */
/** @defgroup SYSCFG_LL_Exported_Functions SYSCFG Exported Functions
  * @{
  */

/**
  * @brief  Get the device version and cut information.
  * @rmtoll DIE_ID PRODUCT/VERSION/REVISION   LL_SYSCFG_GetDeviceID
  * @retval Device ID
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDeviceID(void)
{
  return (uint32_t)READ_REG(SYSCFG->DIE_ID);
}


/**
  * @brief  Get the device cut revision (metal fix) information.
  * @rmtoll DIE_ID REVISION   LL_SYSCFG_GetDeviceRevision
  * @retval Device ID
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDeviceRevision(void)
{
  return (uint32_t)((READ_REG(SYSCFG->DIE_ID) & SYSCFG_DIE_ID_REVISION) >> SYSCFG_DIE_ID_REVISION_Pos);
}

/**
  * @brief  Get the device cut version information.
  * @rmtoll DIE_ID VERSION   LL_SYSCFG_GetDeviceVersion
  * @retval Device ID
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDeviceVersion(void)
{
  return (uint32_t)((READ_REG(SYSCFG->DIE_ID) & SYSCFG_DIE_ID_VERSION) >> SYSCFG_DIE_ID_VERSION_Pos);
}

/**
  * @brief  Get the JTAG_ID device information.
  * @rmtoll JTAG_ID    LL_SYSCFG_GetDeviceJTAG_ID
  * @retval Device ID
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetDeviceJTAG_ID(void)
{
  return (uint32_t)READ_REG(SYSCFG->JTAG_ID);
}

/**
  * @brief  Set memory mapping at address 0x00000000
  * @rmtoll CONFIG REMAP      LL_SYSCFG_SetRemapMemory
  * @param  Memory This parameter can be one of the following values:
  * @arg LL_SYSCFG_REMAP_FLASH
  * @arg LL_SYSCFG_REMAP_SRAM
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetRemapMemory(uint32_t Memory)
{
  MODIFY_REG(FLASH->CONFIG, (FLASH_CONFIG_REMAP), Memory);
}

/**
  * @brief  Get memory mapping at address 0x00000000
  * @rmtoll CONFIG REMAP      LL_SYSCFG_GetRemapMemory
  * @retval Returned value can be one of the following values:
  * @arg LL_SYSCFG_REMAP_FLASH
  * @arg LL_SYSCFG_REMAP_SRAM
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetRemapMemory(void)
{
  uint32_t remap;
  uint32_t memory_map = LL_SYSCFG_REMAP_FLASH;

  remap = READ_BIT(FLASH->CONFIG, FLASH_CONFIG_REMAP) >> FLASH_CONFIG_REMAP_Pos;

  if (remap == 1)
  {
    memory_map = LL_SYSCFG_REMAP_SRAM;
  }
  else
  {
    memory_map = LL_SYSCFG_REMAP_FLASH;
  }
  return memory_map;
}

/**
  * @brief  Enable the I2C fast mode plus driving capability.
  * @rmtoll I2C_FMP_CTRL  I2C1_PAx_FMP/I2C2_PBx_FMP   LL_SYSCFG_EnableFastModePlus
  * @param  ConfigFastModePlus This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA0
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA1
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB6
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB7
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB10
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB11
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA6
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA7
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA13
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA14
  * @retval None
  * @note   LL_SYSCFG_I2C_FASTMODEPLUS_PB10, LL_SYSCFG_I2C_FASTMODEPLUS_PB11, LL_SYSCFG_I2C_FASTMODEPLUS_PA6,
  *         LL_SYSCFG_I2C_FASTMODEPLUS_PA7, LL_SYSCFG_I2C_FASTMODEPLUS_PA13 and LL_SYSCFG_I2C_FASTMODEPLUS_PA14
  */
__STATIC_INLINE void LL_SYSCFG_EnableFastModePlus(uint32_t ConfigFastModePlus)
{
  SET_BIT(SYSCFG->I2C_FMP_CTRL, ConfigFastModePlus);
}

/**
  * @brief  Disable the I2C fast mode plus driving capability.
  * @rmtoll I2C_FMP_CTRL  I2C1_PAx_FMP/I2C2_PBx_FMP   LL_SYSCFG_DisableFastModePlus
  * @param  ConfigFastModePlus This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA0
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA1
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB6
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB7
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB10
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PB11
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA6
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA7
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA13
  * @arg LL_SYSCFG_I2C_FASTMODEPLUS_PA14
  * @retval None
  * @note   LL_SYSCFG_I2C_FASTMODEPLUS_PB10, LL_SYSCFG_I2C_FASTMODEPLUS_PB11, LL_SYSCFG_I2C_FASTMODEPLUS_PA6,
  *         LL_SYSCFG_I2C_FASTMODEPLUS_PA7, LL_SYSCFG_I2C_FASTMODEPLUS_PA13 and LL_SYSCFG_I2C_FASTMODEPLUS_PA14
  */
__STATIC_INLINE void LL_SYSCFG_DisableFastModePlus(uint32_t ConfigFastModePlus)
{
  CLEAR_BIT(SYSCFG->I2C_FMP_CTRL, ConfigFastModePlus);
}

/**
  * @}
  */
/** @defgroup SYSCFG_IO_LL_Exported_Functions EXTI Exported Functions
  * @{
  */
/** @defgroup EXTI_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable IO Interrupt for Lines in range PA0... PB15
  * @rmtoll IO_IER        LL_EXTI_EnableIT
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableIT(uint32_t ExtiLine)
{
  SET_BIT(SYSCFG->IO_IER, ExtiLine);
}

/**
  * @brief  Disable IO Interrupt for Lines in range PA0... PB15
  * @rmtoll IO_IER        LL_EXTI_DisableIT
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableIT(uint32_t ExtiLine)
{
  CLEAR_BIT(SYSCFG->IO_IER, ExtiLine);
}

/**
  * @brief  Indicate if IO Interrupt Mask is enabled
  * @rmtoll IO_IER        LL_EXTI_IsEnabledIT
  * @param  ExtiLine This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledIT(uint32_t ExtiLine)
{
  return ((READ_BIT(SYSCFG->IO_IER, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @}
  */
/** @defgroup EXTI_LL_EF_TYPE_Management Level Edge Management
  * @{
  */

/**
  * @brief  Set IO Interrupt Type for Lines in range PA0... PB15
  * @rmtoll IO_DTR        LL_EXTI_EnableEdgeDetection
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval None
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  */
__STATIC_INLINE void LL_EXTI_EnableEdgeDetection(uint32_t ExtiLine)
{
  CLEAR_BIT(SYSCFG->IO_DTR, ExtiLine);
}

/**
  * @brief  Set IO Interrupt Type for Lines in range PA0... PB15
  * @rmtoll IO_DTR        LL_EXTI_DisableEdgeDetection
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval None
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  */
__STATIC_INLINE void LL_EXTI_DisableEdgeDetection(uint32_t ExtiLine)
{
  SET_BIT(SYSCFG->IO_DTR, ExtiLine);
}

/**
  * @brief  Get IO Interrupt Type for Lines in range PA0... PB15
  * @rmtoll IO_DTR        LL_EXTI_IsEnabledEdgeDetection
  * @param  ExtiLine This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
al One of the following values:
  *         @arg @ref LL_EXTI_TYPE_EDGE
  *         @arg @ref LL_EXTI_TYPE_LEVEL
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledEdgeDetection(uint32_t ExtiLine)
{
  return ((READ_BIT(SYSCFG->IO_DTR, ExtiLine) == (ExtiLine)) ? 0UL : 1UL);
}
/**
  * @}
  */

/** @defgroup EXTI_LL_EF_Trigger_EDGE_Management Trigger Management
  * @{
  */

