stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_system.h
/**
  * @brief  Enable ExtiLine Rising Edge Trigger for Lines in range  PA0... PB15
  * @rmtoll IO_IBER                    LL_EXTI_EnableBothEdgeTrig
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableBothEdgeTrig(uint32_t ExtiLine)
{
  SET_BIT(SYSCFG->IO_IBER, ExtiLine);
}
/**
  * @brief  Disable ExtiLine Rising Edge Trigger for Lines in range PA0... PB15
  * @rmtoll IBER                    LL_EXTI_DisableBothEdgeTrig
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  * @retval None
  */

__STATIC_INLINE void LL_EXTI_DisableBothEdgeTrig(uint32_t ExtiLine)
{
  CLEAR_BIT(SYSCFG->IO_IBER, ExtiLine);
}

/**
  * @brief  Check if rising edge trigger is enabled for Lines in range PA0... PB15
  * @rmtoll IBER                     LL_EXTI_IsEnabledBothEdgeTrig
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  * @retval State of bit (1 or 0).
  */

__STATIC_INLINE uint32_t LL_EXTI_IsEnabledBothEdgeTrig(uint32_t ExtiLine)
{
  return ((READ_BIT(SYSCFG->IO_IBER, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @}
  */


/** @defgroup EXTI_LL_EF_RISING/Falling_Trigger_Management RISING Falling Trigger Management
  * @{
  */

/**
  * @brief  Enable ExtiLine Rising Edge Trigger for Lines in range PA0... PB15
  * @rmtoll IO_IEVR                    LL_EXTI_EnableRisingTrig
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  * @note   Please check each device line mapping for EXTI Line availability
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableRisingTrig(uint32_t ExtiLine)
{
  SET_BIT(SYSCFG->IO_IEVR, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Rising Edge Trigger for Lines in range  PA0... PB15
  * @rmtoll IO_IEVR                    LL_EXTI_DisableRisingTrig
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableRisingTrig(uint32_t ExtiLine)
{
  CLEAR_BIT(SYSCFG->IO_IEVR, ExtiLine);
}

/**
  * @brief  Check if rising edge trigger is enabled for Lines in range PA0... PB15
  * @rmtoll IO_IEVR                   LL_EXTI_IsEnabledRisingTrig
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  * @note   Please check each device line mapping for EXTI Line availability
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledRisingTrig(uint32_t ExtiLine)
{
  return ((READ_BIT(SYSCFG->IO_IEVR, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @}
  */
/** @defgroup EXTI_LL_EF_Flag_Management Flag_Management
  * @{
  */

/**
  * @brief  Check if the ExtLine Flag is set or not for Lines in range  PA0...PB15
  * @rmtoll IO_ISCR                      LL_EXTI_IsActiveFlag
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveFlag(uint32_t ExtiLine)
{
  return ((READ_BIT(SYSCFG->IO_ISCR, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Read ExtLine Combination Flag for Lines in range PA0...PB15
  * @rmtoll IO_ISCR                      LL_EXTI_ReadFlag
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval None
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadFlag(uint32_t ExtiLine)
{
  return (uint32_t)(READ_BIT(SYSCFG->IO_ISCR, ExtiLine));
}

/**
  * @brief  Clear ExtLine Flags for Lines in range PA0...PB15
  * @rmtoll IO_ISCR                     LL_EXTI_ClearFlag
  * @param  ExtiLine This parameter can be a combination of the following values:
  *         @arg @ref LL_EXTI_LINE_PA0
  *         @arg @ref LL_EXTI_LINE_PA1
  *         @arg @ref LL_EXTI_LINE_PA2
  *         @arg @ref LL_EXTI_LINE_PA3
  *         @arg @ref LL_EXTI_LINE_PA4
  *         @arg @ref LL_EXTI_LINE_PA5
  *         @arg @ref LL_EXTI_LINE_PA6
  *         @arg @ref LL_EXTI_LINE_PA7
  *         @arg @ref LL_EXTI_LINE_PA8
  *         @arg @ref LL_EXTI_LINE_PA9
  *         @arg @ref LL_EXTI_LINE_PA10
  *         @arg @ref LL_EXTI_LINE_PA11
  *         @arg @ref LL_EXTI_LINE_PA12
  *         @arg @ref LL_EXTI_LINE_PA13
  *         @arg @ref LL_EXTI_LINE_PA14
  *         @arg @ref LL_EXTI_LINE_PA15
  *         @arg @ref LL_EXTI_LINE_PB0
  *         @arg @ref LL_EXTI_LINE_PB1
  *         @arg @ref LL_EXTI_LINE_PB2
  *         @arg @ref LL_EXTI_LINE_PB3
  *         @arg @ref LL_EXTI_LINE_PB4
  *         @arg @ref LL_EXTI_LINE_PB5
  *         @arg @ref LL_EXTI_LINE_PB6
  *         @arg @ref LL_EXTI_LINE_PB7
  *         @arg @ref LL_EXTI_LINE_PB8
  *         @arg @ref LL_EXTI_LINE_PB9
  *         @arg @ref LL_EXTI_LINE_PB10
  *         @arg @ref LL_EXTI_LINE_PB11
  *         @arg @ref LL_EXTI_LINE_PB12
  *         @arg @ref LL_EXTI_LINE_PB13
  *         @arg @ref LL_EXTI_LINE_PB14
  *         @arg @ref LL_EXTI_LINE_PB15
  *         @arg @ref LL_EXTI_LINE_ALL
  * @retval None
  * @note   PA0-PA15 and PB0-PB15 are valid for STM32WL33
  */
__STATIC_INLINE void LL_EXTI_ClearFlag(uint32_t ExtiLine)
{
  WRITE_REG(SYSCFG->IO_ISCR, ExtiLine);
}

/**
  * @}
  */
/** @defgroup SYSTEM_LL_PWRC SYSCFG
  * @{
  */

/**
  * @brief  Enable PWRC Interrupt Mask
  * @rmtoll PWRC_IER        LL_SYSCFG_PWRC_EnableIT
  * @param  Interrupt This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_PWRC_PVD
  * @arg LL_SYSCFG_PWRC_WKUP
  * @arg LL_SYSCFG_PWRC_BORH
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_PWRC_EnableIT(uint32_t Interrupt)
{
  SET_BIT(SYSCFG->PWRC_IER, Interrupt);
}

/**
  * @brief  Disable PWRC Interrupt Mask
  * @rmtoll PWRC_IER        LL_SYSCFG_PWRC_DisableIT
  * @param  Interrupt This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_PWRC_PVD
  * @arg LL_SYSCFG_PWRC_WKUP
  * @arg LL_SYSCFG_PWRC_BORH
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_PWRC_DisableIT(uint32_t Interrupt)
{
  CLEAR_BIT(SYSCFG->PWRC_IER, Interrupt);
}

/**
  * @brief  Indicate if PWRC Interrupt Mask is enabled
  * @rmtoll PWRC_IER        LL_SYSCFG_PWRC_IsEnabledIT
  * @param  Interrupt This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_PWRC_PVD
  * @arg LL_SYSCFG_PWRC_WKUP
  * @arg LL_SYSCFG_PWRC_BORH
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_PWRC_IsEnabledIT(uint32_t Interrupt)
{
  return ((READ_BIT(SYSCFG->PWRC_IER, Interrupt) == (Interrupt)) ? 1UL : 0UL);
}

/**
  * @brief  Get PWRC Interrupt Status
  * @rmtoll PWRC_ISCR        LL_SYSCFG_PWRC_GetStatusIT
  * @param  Interrupt This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_PWRC_PVD
  * @arg LL_SYSCFG_PWRC_WKUP
  * @arg LL_SYSCFG_PWRC_BORH
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_PWRC_GetStatusIT(uint32_t Interrupt)
{
  return ((READ_BIT(SYSCFG->PWRC_ISCR, Interrupt) == (Interrupt)) ? 1UL : 0UL);
}

/**
  * @brief  Clear PWRC Interrupt Status
  * @rmtoll PWRC_ISCR        LL_SYSCFG_PWRC_ClearIT
  * @param  Interrupt This parameter can be a combination of the following values:
  * @arg LL_SYSCFG_PWRC_PVD
  * @arg LL_SYSCFG_PWRC_WKUP
  * @arg LL_SYSCFG_PWRC_BORH
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_PWRC_ClearIT(uint32_t Interrupt)
{
  SET_BIT(SYSCFG->PWRC_ISCR, Interrupt);
}

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EF_FLASH FLASH
  * @{
  */

/**
  * @brief  Set FLASH wait_states
  * @rmtoll FLASH_CONFIG    Latency      LL_FLASH_SetLatency
  * @param  Latency This parameter can be one of the following values:
  * @arg LL_FLASH_LATENCY_0
  * @arg LL_FLASH_LATENCY_1
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_SetLatency(uint32_t Latency)
{
  MODIFY_REG(FLASH->CONFIG, FLASH_CONFIG_WAIT_STATES, Latency);
}

/**
  * @brief  Get FLASH Latency
  * @rmtoll FLASH_CONFIG    WAIT_STATE     LL_FLASH_GetLatency
  * @retval Returned value can be one of the following values:
  * @arg LL_FLASH_LATENCY_0
  * @arg LL_FLASH_LATENCY_1
  */
__STATIC_INLINE uint32_t LL_FLASH_GetLatency(void)
{
  return (uint32_t)(READ_BIT(FLASH->CONFIG, FLASH_CONFIG_WAIT_STATES));
}
/**
  * @}
  */

/** @defgroup SYSCFG_LL_RADIO_EVENT_TYPE_Management Level/Edge Management
  * @{
  */

/**
  * @brief  Enable Internal asynchronous Interrupt
  * @rmtoll INTAI_IER        LL_SYSCFG_MR_SUBG_INTAI_EnableIT
  * @param  Signal This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_TX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_COMPOUT_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RFIP_BUSY_EVENT
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_MR_SUBG_INTAI_EnableIT(uint32_t Signal)
{
  SET_BIT(SYSCFG->INTAI_IER, Signal);
}

/**
  * @brief  Disable Internal asynchronous Interrupt
  * @rmtoll INTAI_IER        LL_SYSCFG_MR_SUBG_INTAI_DisableIT
  * @param  Signal This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_TX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_COMPOUT_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RFIP_BUSY_EVENT
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_MR_SUBG_INTAI_DisableIT(uint32_t Signal)
{
  CLEAR_BIT(SYSCFG->INTAI_IER, Signal);
}

/**
  * @brief  Indicate if Internal asynchronous Interrupt is enabled
  * @rmtoll INTAI_IER        LL_SYSCFG_MR_SUBG_INTAI_IsEnabledIT
  * @param  Signal This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_TX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_COMPOUT_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RFIP_BUSY_EVENT
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_MR_SUBG_INTAI_IsEnabledIT(uint32_t Signal)
{
  return ((READ_BIT(SYSCFG->INTAI_IER, Signal) == (Signal)) ? 1UL : 0UL);
}


/**
  * @brief  Set Internal asynchronous Interrupt Detection Type
  * @rmtoll INTAI_DTR        LL_SYSCFG_MR_SUBG_INTAI_SetType
  * @param  Type This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_DET_TYPE_EDGE
  *         @arg @ref LL_SYSCFG_MR_SUBG_DET_TYPE_LEVEL
  * @param  Signal This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_TX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_COMPOUT_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RFIP_BUSY_EVENT
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_MR_SUBG_INTAI_SetType(uint8_t Type, uint32_t Signal)
{
  if (Type == LL_SYSCFG_MR_SUBG_DET_TYPE_EDGE)
  {
    CLEAR_BIT(SYSCFG->INTAI_DTR, Signal);
  }
  else
  {
    SET_BIT(SYSCFG->INTAI_DTR, Signal);
  }
}

/**
  * @brief  Get Internal asynchronous Interrupt Detection Type
  * @rmtoll INTAI_DTR        LL_SYSCFG_MR_SUBG_INTAI_GetType
  * @param  Signal This parameter one of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_TX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_COMPOUT_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RFIP_BUSY_EVENT
  * @retval One of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_DET_TYPE_EDGE
  *         @arg @ref LL_SYSCFG_MR_SUBG_DET_TYPE_LEVEL
  */
__STATIC_INLINE uint32_t LL_SYSCFG_MR_SUBG_INTAI_GetType(uint32_t Signal)
{
  if (READ_BIT(SYSCFG->INTAI_DTR, Signal))
  {
    return LL_SYSCFG_MR_SUBG_DET_TYPE_LEVEL;
  }

