stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_system.h
  return LL_SYSCFG_MR_SUBG_DET_TYPE_EDGE;
}

/**
  * @}
  */

/** @defgroup SYSCFG_LL_EF_Trigger_Management Trigger_Management
  * @{
  */

/**
  * @brief  Set Internal asynchronous Interrupt Trigger
  * @rmtoll INTAI_IBER/INTAI_IEVR/INTAI_DTR        LL_SYSCFG_MR_SUBG_INTAI_SetTrigger
  * @param  Trigger This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_TRIGGER_RISING_EDGE
  *         @arg @ref LL_SYSCFG_MR_SUBG_TRIGGER_FALLING_EDGE
  *         @arg @ref LL_SYSCFG_MR_SUBG_TRIGGER_BOTH_EDGE
  *         @arg @ref LL_SYSCFG_MR_SUBG_TRIGGER_LOW_LEVEL
  *         @arg @ref LL_SYSCFG_MR_SUBG_TRIGGER_HIGH_LEVEL
  * @param  Signal This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_TX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_COMPOUT_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RFIP_BUSY_EVENT
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_MR_SUBG_INTAI_SetTrigger(uint8_t Trigger, uint32_t Signal)
{
  switch (Trigger)
  {
    case LL_SYSCFG_MR_SUBG_TRIGGER_BOTH_EDGE:
    {
      SET_BIT(SYSCFG->INTAI_IBER, Signal);
      CLEAR_BIT(SYSCFG->INTAI_IEVR, Signal);
      break;
    }
    case LL_SYSCFG_MR_SUBG_TRIGGER_RISING_EDGE:
    {
      CLEAR_BIT(SYSCFG->INTAI_IBER, Signal);
      SET_BIT(SYSCFG->INTAI_IEVR, Signal);
      break;
    }
    case LL_SYSCFG_MR_SUBG_TRIGGER_FALLING_EDGE:
    {
      CLEAR_BIT(SYSCFG->INTAI_IBER, Signal);
      CLEAR_BIT(SYSCFG->INTAI_IEVR, Signal);
      break;
    }
    case LL_SYSCFG_MR_SUBG_TRIGGER_LOW_LEVEL:
    {
      CLEAR_BIT(SYSCFG->INTAI_IBER, Signal);
      CLEAR_BIT(SYSCFG->INTAI_IEVR, Signal);
      break;
    }
    case LL_SYSCFG_MR_SUBG_TRIGGER_HIGH_LEVEL:
    {
      CLEAR_BIT(SYSCFG->INTAI_IBER, Signal);
      SET_BIT(SYSCFG->INTAI_IEVR, Signal);
      break;
    }
  }
}

/**
  * @brief  Get Internal asynchronous Interrupt Trigger
  * @rmtoll INTAI_IBER/INTAI_IEVR/INTAI_DTR        LL_SYSCFG_MR_SUBG_INTAI_GetTrigger
  * @param  Signal This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_TX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_COMPOUT_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RFIP_BUSY_EVENT
  * @retval The return value can be one of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_TRIGGER_RISING_EDGE
  *         @arg @ref LL_SYSCFG_MR_SUBG_TRIGGER_FALLING_EDGE
  *         @arg @ref LL_SYSCFG_MR_SUBG_TRIGGER_BOTH_EDGE
  *         @arg @ref LL_SYSCFG_MR_SUBG_TRIGGER_LOW_LEVEL
  *         @arg @ref LL_SYSCFG_MR_SUBG_TRIGGER_HIGH_LEVEL
  */
__STATIC_INLINE uint8_t LL_SYSCFG_MR_SUBG_INTAI_GetTrigger(uint32_t Signal)
{
  uint32_t level_setup, level_edge, both_edge;

  level_setup = READ_BIT(SYSCFG->INTAI_DTR, Signal);
  level_edge = READ_BIT(SYSCFG->INTAI_IEVR, Signal);
  both_edge = READ_BIT(SYSCFG->INTAI_IBER, Signal);

  if (level_setup)
  {
    if (level_edge)
    {
      return LL_SYSCFG_MR_SUBG_TRIGGER_HIGH_LEVEL;
    }
    else
    {
      return LL_SYSCFG_MR_SUBG_TRIGGER_LOW_LEVEL;
    }
  }
  else
  {
    if (both_edge)
    {
      return LL_SYSCFG_MR_SUBG_TRIGGER_BOTH_EDGE;
    }
    if (level_edge)
    {
      return LL_SYSCFG_MR_SUBG_TRIGGER_RISING_EDGE;
    }
  }
  return LL_SYSCFG_MR_SUBG_TRIGGER_FALLING_EDGE;
}


/**
  * @brief Check if the Internal asynchronous Interrupt is set or not
  * @note  This bit is cleared by writing a 1 to the bit.
  * @rmtoll INTAI_ISCR                   LL_SYSCFG_MR_SUBG_INTAI_IsInterruptPending
  * @param  Signal This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_TX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_COMPOUT_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RFIP_BUSY_EVENT
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_MR_SUBG_INTAI_IsInterruptPending(uint32_t Signal)
{
  return ((READ_BIT(SYSCFG->INTAI_ISCR, Signal) == (Signal)) ? 1UL : 0UL);
}


/**
  * @brief  Clear the Internal asynchronous Interrupt
  * @rmtoll INTAI_ISCR                   LL_SYSCFG_MR_SUBG_INTAI_ClearInterrupt
  * @param  Signal This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_MR_SUBG_TX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RX_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_COMPOUT_EVENT
  *         @arg @ref LL_SYSCFG_MR_SUBG_RFIP_BUSY_EVENT
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_MR_SUBG_INTAI_ClearInterrupt(uint32_t Signal)
{
  WRITE_REG(SYSCFG->INTAI_ISCR, Signal);
}

/**
  * @brief   Set interrupt edge register on LC_ACTIVITY signal detection on single or both edges.
  * @rmtoll INTAI_IBER                   LL_SYSCFG_LCSC_INTAI_IBER_Edge_Detection
  * @param  Value This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_LCSC_IBER_SINGLE
  *         @arg @ref LL_SYSCFG_LCSC_IBER_BOTH
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_LCSC_INTAI_IBER_Edge_Detection(uint32_t Value)
{
  MODIFY_REG(SYSCFG->INTAI_IBER, SYSCFG_INTAI_IBER_LC_ACTIVITY_IBE, Value);
}



/**
  * @brief  Check if the Internal asynchronous Interrupt is set or not
  * @note   This bit is cleared by writing a 1 to the bit.
  * @rmtoll INTAI_ISCR                   LL_SYSCFG_LCSC_INTAI_IsInterruptPending
  * @param  Value This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_LCSC_LC_ACTIVITY_ISC
  *         @arg @ref LL_SYSCFG_LCSC_LC_ACTIVITY_ISEDGE
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_LCSC_INTAI_IsInterruptPending(uint32_t Value)
{
  return ((READ_BIT(SYSCFG->INTAI_ISCR, Value) == (Value)) ? 1UL : 0UL);
}


/**
  * @brief  Clear the Internal asynchronous Interrupt
  * @rmtoll INTAI_ISCR                   LL_SYSCFG_LCSC_INTAI_ClearInterrupt
  * @param  Signal This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_LCSC_LC_ACTIVITY_ISC
  *         @arg @ref LL_SYSCFG_LCSC_LC_ACTIVITY_ISEDGE
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_LCSC_INTAI_ClearInterrupt(uint32_t Signal)
{
  WRITE_REG(SYSCFG->INTAI_ISCR, Signal);
}

/**
  * @}
  */

