stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_system.h
/** @defgroup SYSTEM_LL_ANALOG_SWITCH Analog source selection to connect on analog pads
  * @{
  */
/**
  * @brief  Setup analog feature on PB14 between ATB1 and PVD when the PB14 I/O
  *         is programmed in analog mode
  * @rmtoll GPIO_SWA_CTRL    ATB1_nPVD   LL_IO_AnalogSwitchControl_PB14
  * @param  feature this parameter can be one of the following values:
  * @arg LL_SYSCFG_PB14_PVD
  * @arg LL_SYSCFG_PB14_ATB1
  * @retval None
  */
__STATIC_INLINE void LL_IO_SetAnalogSwitchControl_PB14(uint32_t feature)
{
  MODIFY_REG(SYSCFG->GPIO_SWA_CTRL, SYSCFG_GPIO_SWA_CTRL_ATB1_nPVD, feature);
}

/**
  * @brief  Setup analog feature on PB14 between ATB1 and PVD when the PB14 I/O
  *         is programmed in analog mode
  * @rmtoll GPIO_SWA_CTRL    ATB1_nPVD   LL_IO_AnalogSwitchControl_PB14
  * @retval The return value can be one of the following values:
  * @arg LL_SYSCFG_PB14_PVD
  * @arg LL_SYSCFG_PB14_ATB1
  */
__STATIC_INLINE uint32_t LL_IO_GetAnalogSwitchControl_PB14(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->GPIO_SWA_CTRL, SYSCFG_GPIO_SWA_CTRL_ATB1_nPVD));
}

/**
  * @brief  Set the interrupt polarity event on LC_ACTIVITY signal detection on falling edge / low level or on rising edge / high level
  * @rmtoll INTAI_IEVR                   LL_SYSCFG_LCSC_INTAI_IEVR_Polarity
  * @param  Value This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_LCSC_IEVR_FALLING
  *         @arg @ref LL_SYSCFG_LCSC_IEVR_RISING
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_LCSC_INTAI_IEVR_Polarity(uint32_t Value)
{
  MODIFY_REG(SYSCFG->INTAI_IEVR, SYSCFG_INTAI_IEVR_LC_ACTIVITY_IEV, Value);
}

/**
  * @brief  Check if MR_SUBG is busy
  * @rmtoll SYSCFG_SR1  RFIP_BUSY_STATUS      LL_SYSCFG_IsMR_SUBGBusy
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsMR_SUBGBusy(void)
{
  return ((READ_BIT(SYSCFG->SR1, SYSCFG_SR1_RFIP_BUSY_STATUS) == (SYSCFG_SR1_RFIP_BUSY_STATUS)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the Debug Module during STOP mode
  * @rmtoll DBG_CR    DBG_STOP      LL_DBGMCU_EnableDBGStopMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableDBGStopMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Disable the Debug Module during STOP mode
  * @rmtoll DBG_CR    DBG_STOP      LL_DBGMCU_DisableDBGStopMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableDBGStopMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Enable the Debug Module during SLEEP mode
  * @rmtoll DBG_CR    DBG_SLEEP   LL_DBGMCU_EnableDBGSleepMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableDBGSleepMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Disable the Debug Module during SLEEP mode
  * @rmtoll DBG_CR    DBG_SLEEP   LL_DBGMCU_DisableDBGSleepMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableDBGSleepMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Freeze APB0 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB0FZR DBG_xxxx_STOP  LL_DBGMCU_APB0_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB0_GRP1_TIM2_STOP
  *         @arg @ref LL_DBGMCU_APB0_GRP1_TIM16_STOP
  *         @arg @ref LL_DBGMCU_APB0_GRP1_RTC_STOP
  *         @arg @ref LL_DBGMCU_APB0_GRP1_IWDG_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB0_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->DBG_APB0_FZ, Periphs);
}

/**
  * @brief  Freeze APB1 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB1FZR DBG_xxxx_STOP  LL_DBGMCU_APB1_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C2_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->DBG_APB1_FZ, Periphs);
}

/**
  * @brief  Unfreeze APB0 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB1FZR DBG_xxxx_STOP  LL_DBGMCU_APB0_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB0_GRP1_TIM2_STOP
  *         @arg @ref LL_DBGMCU_APB0_GRP1_TIM16_STOP
  *         @arg @ref LL_DBGMCU_APB0_GRP1_RTC_STOP
  *         @arg @ref LL_DBGMCU_APB0_GRP1_IWDG_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB0_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->DBG_APB0_FZ, Periphs);
}

/**
  * @brief  Unfreeze CPU1 APB1 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB1FZR DBG_xxxx_STOP  LL_DBGMCU_APB1_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C2_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->DBG_APB1_FZ, Periphs);
}
/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup SYSCFG_IO_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

ErrorStatus LL_SYSCFG_IO_Init(LL_SYSCFG_IO_InitTypeDef *SYSCFG_IO_InitStruct);
ErrorStatus LL_SYSCFG_IO_DeInit(void);
void LL_SYSCFG_IO_StructInit(LL_SYSCFG_IO_InitTypeDef *SYSCFG_IO_InitStruct);

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (FLASH) || defined (SYSCFG) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32WL3x_LL_SYSTEM_H */